#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3.aws_s3_bucket_acl.log has changed
  ~ resource "aws_s3_bucket_acl" "log" {
        id                    = "aih.dev.br-log,log-delivery-write"
        # (3 unchanged attributes hidden)

      ~ access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name  = "awslogsdelivery+s3_us-east-1" -> null
                  - id            = "c4c1ede66af53448b93c283ce9448c4ba468c9432aa01d700d3878632f77d2d0" -> null
                  - type          = "CanonicalUser" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name  = "hiagop101197" -> null
                  - id            = "379ab14eb2e1ef37f67395d7397e36572e6ebd5df015a9f51301eea34e7d636b" -> null
                  - type          = "CanonicalUser" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          + grant {
              + permission = "FULL_CONTROL"

              + grantee {
                  + id            = "379ab14eb2e1ef37f67395d7397e36572e6ebd5df015a9f51301eea34e7d636b"
                  + type          = "CanonicalUser"
                    # (3 unchanged attributes hidden)
                }
            }
          + grant {
              + permission = "FULL_CONTROL"

              + grantee {
                  + id            = "c4c1ede66af53448b93c283ce9448c4ba468c9432aa01d700d3878632f77d2d0"
                  + type          = "CanonicalUser"
                    # (3 unchanged attributes hidden)
                }
            }
          ~ owner {
              - display_name = "hiagop101197" -> null
                id           = "379ab14eb2e1ef37f67395d7397e36572e6ebd5df015a9f51301eea34e7d636b"
            }

            # (2 unchanged blocks hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3.aws_s3_object.upload_object["assets/certifications/gcp_ace.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "f75008034392bf7356a6c6a44e854981"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/certifications/gcp_ace.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/certifications/gcp_ace.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/cert-gcpace.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "f75008034392bf7356a6c6a44e854981"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/cert-gcpace.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/cert-gcpace.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_object" {
      ~ etag                          = "1585f746be723c62f05d88fbca1e2878" -> "dc3c93e323c7d436990bd6693c91464c"
        id                            = "index.html"
        tags                          = {}
      + version_id                    = (known after apply)
        # (22 unchanged attributes hidden)
    }

  # module.s3.aws_s3_object.upload_object["main-ITGMCRMG.js"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "002e2bcedfbc5154c8fbdf3813c43895"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "main-ITGMCRMG.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/main-ITGMCRMG.js"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["main-T2VSLN2V.js"] will be destroyed
  # (because key ["main-T2VSLN2V.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_object" {
      - bucket                        = "aih.dev.br" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "275ad47fc5bcc8bbfbdc081506ca5090" -> null
      - force_destroy                 = false -> null
      - id                            = "main-T2VSLN2V.js" -> null
      - key                           = "main-T2VSLN2V.js" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../website/dist/personal-website/browser/main-T2VSLN2V.js" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "CreatedAt" = "2024-03-16"
          - "Project"   = "AWS com Terraform"
          - "Service"   = "Static Website"
        } -> null
        # (13 unchanged attributes hidden)
    }

  # module.s3.aws_s3_object.upload_object["media/cert-gcpace-OJQPN4LK.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "f75008034392bf7356a6c6a44e854981"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/cert-gcpace-OJQPN4LK.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/cert-gcpace-OJQPN4LK.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["styles-DRSA65TI.css"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "e8f89d87f8530bea878356c7115948a3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "styles-DRSA65TI.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/styles-DRSA65TI.css"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["styles-YUE2RBED.css"] will be destroyed
  # (because key ["styles-YUE2RBED.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_object" {
      - bucket                        = "aih.dev.br" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "text/css; charset=utf-8" -> null
      - etag                          = "1be00fae89236d351d9052e64971ee90" -> null
      - force_destroy                 = false -> null
      - id                            = "styles-YUE2RBED.css" -> null
      - key                           = "styles-YUE2RBED.css" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../website/dist/personal-website/browser/styles-YUE2RBED.css" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "CreatedAt" = "2024-03-16"
          - "Project"   = "AWS com Terraform"
          - "Service"   = "Static Website"
        } -> null
        # (13 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ fileset-results = [
        # (1 unchanged element hidden)
        "index.html",
      ~ "main-T2VSLN2V.js" -> "main-ITGMCRMG.js",
        "polyfills-RT5I6R6G.js",
      ~ "styles-YUE2RBED.css" -> "styles-DRSA65TI.css",
    ]
```

</details>

*Pusher: @hiagop22, Action: `pull_request`, Workflow: `Terraform Plan`*